{"0": {"abstract": "Financial market websites contain valuable financial market information from banks, brokers, exchanges and financial service providers, e. g. stock quotes, option prices, exchange rates in particular and other...", "metadata": "Patrick Bartels, Michael H. Breitner in Impulse aus der Wirtschaftsinformatik", "pdf": false, "title": "Finance Applications with the Web Mining Software Agent PISA", "url": "https://link.springer.com/chapter/10.1007/978-3-7908-2683-8_9"}, "1": {"abstract": "Patients with renal insufficiency often react abnormally to a number of drugs. Small doses that are perfectly safe under normal conditions may cause severe and even fatal side effects. Too frequently, these un...", "metadata": "Jean Fabre, Irving Ohr in Ergebnisse der Inneren Medizin und Kinderheilkunde", "pdf": false, "title": "Drug Selection and Dosage in Renal Insufficiency", "url": "https://link.springer.com/chapter/10.1007/978-3-642-65746-7_3"}, "2": {"abstract": "With discussions about increasing the Euro bailout fund or providing Spain’s banking sector with emergency loans, Europe is making a major effort to saving the Euro and the European banking system. The questio...", "metadata": "Robert Günther in Macht des Vertrauens", "pdf": false, "title": "Are Contingent Convertible Bonds a Valid Instrument for the European Banking Sector to Win Back Trust in the Current Market Environment?", "url": "https://link.springer.com/chapter/10.1007/978-3-8349-4453-5_6"}, "3": {"abstract": "We consider the task of analyzing message-passing programs by observing their run-time behavior. We introduce a purely library-based instrumentation method to trace communication events during execution. A mod...", "metadata": "Martin Sulzmann, Kai Stadtmüller in Hardware and Software: Verification and Testing", "pdf": false, "title": "Trace-Based Run-Time Analysis of Message-Passing Go Programs", "url": "https://link.springer.com/chapter/10.1007/978-3-319-70389-3_6"}, "4": {"abstract": "The efficient market hypothesis states that investors immediately incorporate all available information into the price of an asset to accurately reflect its value at any given time. The sheer volume of informa...", "metadata": "Calum Robertson, Shlomo Geva, Rodney Wolff in Emerging Technologies in Knowledge Discove…", "pdf": false, "title": "Predicting the Short-Term Market Reaction to Asset Specific News: Is Time Against Us?", "url": "https://link.springer.com/chapter/10.1007/978-3-540-77018-3_3"}, "5": {"abstract": "This past Monday’s edition of The Wall Street Journal ran an article titled, ‘Volatility Requires New Strategies.’37 The article examined how traders at the mutual fund company, Lord Abbett & Co. in Jersey City, ...", "metadata": "Terrence Martell, George Bodine, Brendan Doran, Brian Hyndman, Tim Mahoney in Volatility", "pdf": false, "title": "Volatility and Market Structure", "url": "https://link.springer.com/chapter/10.1007/978-1-4419-1474-3_5"}, "6": {"abstract": "JOSEPH GAWRONSKI: I am pleased to introduce our next panel: Paul Davis, a passionate follower of market structure who recently retired from TIAA-CREF, where he is still active part-time; Fred Federspiel of Pip...", "metadata": "Joseph Gawronski, Paul Davis, Fred Federspiel, Robert Gauvain in Technology and Regulation", "pdf": false, "title": "What the Buy-Side Needs", "url": "https://link.springer.com/chapter/10.1007/978-1-4419-0480-5_5"}, "7": {"abstract": "Consider a company that manufactures perishable goods. The company relies on a third party to deliver goods, which picks up delivery products at regular times. At each delivery time, there is a time window tha...", "metadata": "Yumei Huo, Joseph Y. -T. Leung, Xin Wang in Combinatorial Optimization and Applications", "pdf": false, "title": "Integrated Production and Delivery Scheduling with Disjoint Windows", "url": "https://link.springer.com/chapter/10.1007/978-3-642-02026-1_45"}, "8": {"abstract": "The popularity of social media as a medium for sharing information has made extracting information of interest a challenge. In this work we provide a system that can return posts published on social media cove...", "metadata": "Ullas Nambiar, Tanveer Faruquie, Shamanth Kumar, Fred Morstatter in Big Data Analytics", "pdf": false, "title": "Faceted Browsing over Social Media", "url": "https://link.springer.com/chapter/10.1007/978-3-642-35542-4_8"}, "9": {"abstract": "", "metadata": "Moderator William Freund, Michael Cormack in A Trading Desk’s View of Market Quality", "pdf": false, "title": "Perspective of the Market Architects", "url": "https://link.springer.com/chapter/10.1007/0-387-23114-5_5"}, "10": {"abstract": "Electronic markets are increasingly gaining importance in the coordination of complex allocation problems. One reason for market failure is the inherent complexity excluding non-sophisticated users. Recently r...", "metadata": "Florian Teschner, Christof Weinhardt in Auctions, Market Mechanisms, and Their Applications", "pdf": false, "title": "Evaluating Hidden Market Design", "url": "https://link.springer.com/chapter/10.1007/978-3-642-30913-7_3"}, "11": {"abstract": "Accurately predicting stock prices is of great interest to both academics and practitioners. However, despite considerable efforts over the last few decades, it still remains an elusive challenge. For each of ...", "metadata": "Bruce James Vanstone, Adrian Gepp in Recent Trends and Future Technology in App…", "pdf": false, "title": "The Effect of Sentiment on Stock Price Prediction", "url": "https://link.springer.com/chapter/10.1007/978-3-319-92058-0_53"}, "12": {"abstract": "The debate on sources of hedge fund returns is one of the subjects creating the most heated discussion within the hedge fund industry. The industry thereby appears to be split in two camps: Following results o...", "metadata": "Lars Jaeger in Risk Assessment", "pdf": false, "title": "The Road to Hedge Fund Replication: The Very First Steps", "url": "https://link.springer.com/chapter/10.1007/978-3-7908-2050-8_8"}, "13": {"abstract": "The problem of modeling the continuously changing trends in finance markets and generating real-time, meaningful predictions about significant changes in those markets has drawn considerable interest from econ...", "metadata": "Fang Jin, Wei Wang, Prithwish Chakraborty in Advances in Data Mining. Applications and …", "pdf": false, "title": "Tracking Multiple Social Media for Stock Market Event Prediction", "url": "https://link.springer.com/chapter/10.1007/978-3-319-62701-4_2"}, "14": {"abstract": "Unified Financial Portfolio is a financial application that applies concepts of information retrieval and Web 2.0 to provide a better understanding of the market trends taking into account the users informatio...", "metadata": "Camilo Restrepo-Arango, Arturo Henao-Chaparro in Advances in Conceptual Modeling", "pdf": false, "title": "Using the Web to Monitor a Customized Unified Financial Portfolio", "url": "https://link.springer.com/chapter/10.1007/978-3-642-33999-8_42"}, "15": {"abstract": "", "metadata": "Kim Bang, Robert Hegarty, Richard Repetto, Jamie Selway in The New Nasdaq Marketplace", "pdf": false, "title": "The Nasdaq Marketplace", "url": "https://link.springer.com/chapter/10.1007/0-387-48601-1_4"}, "16": {"abstract": "ANDREW BROOKS: This has been a difficult decade for equity investors. It was a decade characterized by two generational bear markets followed by this incredible afternoon earlier this year, the Flash Crash on ...", "metadata": "Moderator Andrew Brooks, Robert Gasser in The Quality of Our Financial Markets", "pdf": false, "title": "May 6: Lessons Learned and Questions Raised", "url": "https://link.springer.com/chapter/10.1007/978-1-4614-5592-9_3"}, "17": {"abstract": "This study discusses the evolution of KSE-100 index returns as a dynamical system. We present application of nonlinear time-series analysis. Our results show that estimation of correlation dimension for the ca...", "metadata": "Syed Nasir Danial, Syed Raheel Noor in Wireless Networks, Information Processing …", "pdf": false, "title": "A Dynamical System and Neural Network Perspective of Karachi Stock Exchange", "url": "https://link.springer.com/chapter/10.1007/978-3-540-89853-5_11"}, "18": {"abstract": "Large-scale datasets of consumer behavior might revolutionize the way we gain competitive advantages and increase our knowledge in the respective domains. At the same time, valuable datasets pose potential pri...", "metadata": "Arthur Gervais, Hubert Ritzdorf, Mario Lucic in Computer Security – ESORICS 2016", "pdf": false, "title": "Quantifying Location Privacy Leakage from Transaction Prices", "url": "https://link.springer.com/chapter/10.1007/978-3-319-45741-3_20"}, "19": {"abstract": "The problems of character recognition are today mainly due to imperfect thresholding and segmentation. In this paper a new approach to text recognition is presented which attempts to avoid these problems by wo...", "metadata": "Kjersti Aas, Line Eikvil, Tove Andersen in Computer Analysis of Images and Patterns", "pdf": false, "title": "Text recognition from grey level images using hidden Markov models", "url": "https://link.springer.com/chapter/10.1007/3-540-60268-2_335"}}