{"0": {"abstract": "No abstract available", "metadata": "A. B. Sandberg, I. Crnkovic - 2017 IEEE/ACM 39th International Conference on Software Engineering: Software Engineering in Practice Track (ICSE-SEIP), 2017", "pdf": false, "title": "Meeting Industry-Academia Research Collaboration Challenges with Agile Methodologies", "url": "https://ieeexplore.ieee.org/document/7965431/"}, "1": {"abstract": "No abstract available", "metadata": "M. Schots, C. Werner, M. Mendonça - 2012 26th Brazilian Symposium on Software Engineering, 2012", "pdf": false, "title": "Awareness and Comprehension in Software/Systems Engineering Practice and Education: Trends and Research Directions", "url": "https://ieeexplore.ieee.org/document/6337872/"}, "2": {"abstract": "No abstract available", "metadata": "K. P. Choudhury, M. Rokonuzzaman - 2009 12th International Conference on Computers and Information Technology, 2009", "pdf": false, "title": "A recommended market research based approach for small software companies for improving systematic reuse capability in delivering customized software solutions", "url": "https://ieeexplore.ieee.org/document/5407289/"}, "3": {"abstract": "No abstract available", "metadata": "D. I. K. Sjoeberg, J. E. Hannay, O. Hansen, V. B. Kampenes, A. Karahasanovic, N. -. Liborg, A. C. Rekdal - IEEE Transactions on Software Engineering, 2005", "pdf": false, "title": "A survey of controlled experiments in software engineering", "url": "https://ieeexplore.ieee.org/document/1514443/"}, "4": {"abstract": "No abstract available", "metadata": "E. Bouwers, A. van Deursen, J. Visser - 2013 35th International Conference on Software Engineering (ICSE), 2013", "pdf": false, "title": "Software metrics: Pitfalls and best practices", "url": "https://ieeexplore.ieee.org/document/6606755/"}, "5": {"abstract": "No abstract available", "metadata": "J. Suzuki, Y. Yamamoto - Proceedings 4th IEEE International Software Engineering Standards Symposium and Forum (ISESS'99). 'Best Software Practices for the Internet Age', 1999", "pdf": false, "title": "Toward the interoperable software design models: quartet of UML, XML, DOM and CORBA", "url": "https://ieeexplore.ieee.org/document/766591/"}, "6": {"abstract": "No abstract available", "metadata": "Y. Wang, H. Wickberg, A. Dorling, M. Kaartinen - Proceedings 4th IEEE International Software Engineering Standards Symposium and Forum (ISESS'99). 'Best Software Practices for the Internet Age', 1999", "pdf": false, "title": "Establishment of a national benchmark of software engineering practices", "url": "https://ieeexplore.ieee.org/document/766574/"}, "7": {"abstract": "No abstract available", "metadata": "S. Vasanthapriyan - 2018 IEEE International Conference on Software Quality, Reliability and Security Companion (QRS-C), 2018", "pdf": false, "title": "A Study of Software Testing Practices in Sri Lankan Software Companies", "url": "https://ieeexplore.ieee.org/document/8431994/"}, "8": {"abstract": "No abstract available", "metadata": "M. Polo, M. Piattini, F. Ruiz, C. Calero - Proceedings 4th IEEE International Software Engineering Standards Symposium and Forum (ISESS'99). 'Best Software Practices for the Internet Age', 1999", "pdf": false, "title": "MANTEMA: a software maintenance methodology based on the ISO/IEC 12207 standard", "url": "https://ieeexplore.ieee.org/document/766580/"}, "9": {"abstract": "No abstract available", "metadata": "C. W. Krueger - 2008 12th International Software Product Line Conference, 2008", "pdf": false, "title": "Pragmatic Methods for Commercial Software Product Line Engineering Practice", "url": "https://ieeexplore.ieee.org/document/4626886/"}, "10": {"abstract": "No abstract available", "metadata": "Y. Sun, X. Liu - 2012 7th International Conference on Computer Science & Education (ICCSE), 2012", "pdf": false, "title": "Educating students by “real-world” software engineering practice — Designing software engineering practice course", "url": "https://ieeexplore.ieee.org/document/6295315/"}, "11": {"abstract": "No abstract available", "metadata": "T. Keller, N. F. Schneidewind - Proceedings The Eighth International Symposium on Software Reliability Engineering - Case Studies -, 1997", "pdf": false, "title": "Successful application of software reliability engineering for the NASA Space Shuttle", "url": "https://ieeexplore.ieee.org/document/637849/"}, "12": {"abstract": "No abstract available", "metadata": "S. Bryton, F. B. e. Abreu - 2009 Fourth International Conference on Software Engineering Advances, 2009", "pdf": false, "title": "Strengthening Refactoring: Towards Software Evolution with Quantitative and Experimental Grounds", "url": "https://ieeexplore.ieee.org/document/5298727/"}, "13": {"abstract": "No abstract available", "metadata": "A. A. Rahman - 2015 3rd International Conference on Artificial Intelligence, Modelling and Simulation (AIMS), 2015", "pdf": false, "title": "Defining Methodology for Multi Model Software Process Improvement Framework", "url": "https://ieeexplore.ieee.org/document/7604583/"}, "14": {"abstract": "No abstract available", "metadata": "D. Fontdevila - 2017 IEEE/ACM 1st International Workshop on Software Engineering Curricula for Millennials (SECM), 2017", "pdf": false, "title": "Tales from an Agile Journey: Designing Curricula for Millennials in Industry and Academia", "url": "https://ieeexplore.ieee.org/document/7964614/"}, "15": {"abstract": "No abstract available", "metadata": "Y. Sun - 2011 24th IEEE-CS Conference on Software Engineering Education and Training (CSEE&T), 2011", "pdf": false, "title": "The challenge and practice of creating Software Engineering curriculum", "url": "https://ieeexplore.ieee.org/document/5876132/"}, "16": {"abstract": "No abstract available", "metadata": "S. Biffl, T. Grechenig - Proceedings of 1993 IEEE 17th International Computer Software and Applications Conference COMPSAC '93, 1993", "pdf": false, "title": "Degrees of consciousness for reuse of software in practice: Maintainability, balance, standardization", "url": "https://ieeexplore.ieee.org/document/404222/"}, "17": {"abstract": "No abstract available", "metadata": "T. Grechenig, W. Zuser - Fourth International Conference onQuality Software, 2004. QSIC 2004. Proceedings., 2004", "pdf": false, "title": "Creating organic software maturity attitudes (COSMA) selected principles and activities for software maturity in small and medium software enterprises", "url": "https://ieeexplore.ieee.org/document/1357954/"}, "18": {"abstract": "No abstract available", "metadata": "P. S. S. Martín, G. L. Rodríguez - 2017 Twelfth Latin American Conference on Learning Technologies (LACLO), 2017", "pdf": false, "title": "Creative monument: Towards mediated educational practices for the socialization of heritage", "url": "https://ieeexplore.ieee.org/document/8120920/"}, "19": {"abstract": "No abstract available", "metadata": "A. Yamashita - 2015 IEEE International Conference on Software Maintenance and Evolution (ICSME), 2015", "pdf": false, "title": "Experiences from performing software quality evaluations via combining benchmark-based metrics analysis, software visualization, and expert assessment", "url": "https://ieeexplore.ieee.org/document/7332493/"}, "20": {"abstract": "No abstract available", "metadata": "K. Jinzenji, T. Hoshino, L. Williams, K. Takahashi - 2013 IEEE 24th International Symposium on Software Reliability Engineering (ISSRE), 2013", "pdf": false, "title": "An experience report for software quality evaluation in highly iterative development methodology using traditional metrics", "url": "https://ieeexplore.ieee.org/document/6698884/"}, "21": {"abstract": "No abstract available", "metadata": "T. Keller, N. F. Schneidewind - Proceedings The Eighth International Symposium on Software Reliability Engineering, 1997", "pdf": false, "title": "Successful application of software reliability engineering for the NASA Space Shuttle", "url": "https://ieeexplore.ieee.org/document/630854/"}, "22": {"abstract": "No abstract available", "metadata": "E. F. Barry, C. Norris - Proceedings Frontiers in Education 35th Annual Conference, 2005", "pdf": false, "title": "Work in progress - project ClockIt: profiling and improving student software development practices", "url": "https://ieeexplore.ieee.org/document/1612180/"}, "23": {"abstract": "No abstract available", "metadata": "H. Sun, L. Cai, X. Liu, H. Song, G. Yang, Z. Liu, Z. Meng - 2010 International Conference on Computational Intelligence and Software Engineering, 2010", "pdf": false, "title": "Domain-Specific Software Benchmarking Methodology Based on Fuzzy Set Theory and AHP", "url": "https://ieeexplore.ieee.org/document/5676892/"}, "24": {"abstract": "No abstract available", "metadata": "J. Kroll, J. L. N. Audy - 2012 IEEE Seventh International Conference on Global Software Engineering Workshops, 2012", "pdf": false, "title": "Follow-the-Sun Strategy: A Process for Global Software Development", "url": "https://ieeexplore.ieee.org/document/6337325/"}, "25": {"abstract": "In recent decades, argentinian universities, are inserted into the productive environment from creating business incubators university, turned into one of the mechanisms for technology transfer reference. Thes...", "metadata": "Patricia Paola Zachman, Andrés Redchuk in New Advances in Information Systems and Te…", "pdf": false, "title": "Singularities of the University Spin-off in Northern Argentina", "url": "https://link.springer.com/chapter/10.1007/978-3-319-31307-8_13"}, "26": {"abstract": "Software development projects can be managed under a great variety of methodologies and frameworks. Use of traditional frameworks can ... take a significant amount of time. Agile methodologies are designed to acc...", "metadata": "Andrés Felipe Bustamante in Trends and Applications in Software Engine…", "pdf": false, "title": "Structure of a Multi-model Catalog for Software Projects Management Including Agile and Traditional Practices", "url": "https://link.springer.com/chapter/10.1007/978-3-319-26285-7_8"}, "27": {"abstract": "At the domestic and regional level most organizations willing to participate in software development projects at international off-shore markets operates at small or medium organizational sizes and therefore i...", "metadata": "Pedro E. Colla, Jorge Marcelo Montagna in Software Engineering Approaches for Offsho…", "pdf": false, "title": "Evaluation of Software Process Improvement in Small Organizations", "url": "https://link.springer.com/chapter/10.1007/978-3-642-01856-5_5"}, "28": {"abstract": "There are several models used in the software process improvement such as CMMI and ISO/IEC 15504 that provide advantages to software organizations, like their improvement in ability and maturity which is refle...", "metadata": "Juan Miramontes, Mirna Muñoz in Trends and Applications in Software Engine…", "pdf": false, "title": "Establishing the State of the Art of Frameworks, Methods and Methodologies Focused on Lightening Software Process: A Systematic Literature Review", "url": "https://link.springer.com/chapter/10.1007/978-3-319-26285-7_7"}, "29": {"abstract": "Agile methodologies are often not used “out of the box” by practitioners, instead they select the practices that fit their needs best. However, little is known which agile practices the practitioners choose. T...", "metadata": "Narendra Kurapati in Agile Processes in Software Engineering an…", "pdf": false, "title": "Agile Software Development Practice Adoption Survey", "url": "https://link.springer.com/chapter/10.1007/978-3-642-30350-0_2"}, "30": {"abstract": "Software development organizations have had significant economic impact activity in recent years. The growing of the software demand has created opportunities for very small entities (VSEs) to produce software...", "metadata": "Mirna Muñoz, Jezreel Mejia in Trends and Applications in Software Engine…", "pdf": false, "title": "Reinforcing Very Small Entities Using Agile Methodologies with the ISO/IEC 29110", "url": "https://link.springer.com/chapter/10.1007/978-3-030-01171-0_8"}, "31": {"abstract": "Eckhardt and Lee have shown that, in a precisely defined sense, the independent development of multi-version software cannot result in independence of failure behaviour. We have shown in earlier work that the ...", "metadata": "B. Littlewood, D. R. Miller in Fehlertolerierende Rechensysteme / Fault-T…", "pdf": false, "title": "A Conceptual Model of the Effect of Diverse Methodologies on Coincident Failures in Multi-Version Software", "url": "https://link.springer.com/chapter/10.1007/978-3-642-45628-2_23"}, "32": {"abstract": "In this paper, we will describe the evolution of our software development techniques, and analyze actual methodologies in-depth. These are internally developed and do not refers to any standard, but they are m...", "metadata": "Andrea Rinaldi, Luigi Benedicenti in Extreme Programming and Agile Processes in…", "pdf": false, "title": "Building Standard ERP Software Packages Using Self-developed Agile Methodologies", "url": "https://link.springer.com/chapter/10.1007/3-540-44870-5_54"}, "33": {"abstract": "...The learning of technical and science disciplines requires experimental and practical training. Hands-on labs are the natural scenarios where practical skills can be developed but, thanks to Information and Co...", "metadata": "Unai Hernandez-Jayo, Javier Garcia-zubia in Online Engineering & Internet of Things", "pdf": false, "title": "Spreading the VISIR Remote Lab Along Argentina. The Experience in Patagonia", "url": "https://link.springer.com/chapter/10.1007/978-3-319-64352-6_27"}, "34": {"abstract": "While most agile methodologies assume that change is inevitable, current approaches have adopted the strategy of defining practices and activities that are general enough to be adapted to many project settings. T...", "metadata": "Scott Henninger, Aditya Ivaturi in Extreme Programming and Agile Methods — XP…", "pdf": false, "title": "Supporting Adaptable Methodologies to Meet Evolving Project Needs", "url": "https://link.springer.com/chapter/10.1007/3-540-45672-4_4"}, "35": {"abstract": "Argentina’s software industry is orders of magnitude smaller than the largest software industries in the world like India’s. However, it has seen impressive growth over the last years, with ratios ranging from...", "metadata": "Santiago Ceria, Carlos Pallotti in Software Engineering Approaches for Offsho…", "pdf": false, "title": "Argentina’s Offshore Software Industry – Opportunities and Challenges", "url": "https://link.springer.com/chapter/10.1007/978-3-642-13784-6_4"}, "36": {"abstract": "The paper is a work in progress developed with the collaboration of the Laboratory of Computer Science of the Faculty of Engineering of the University of Buenos Aires. The main aim of this research is the anal...", "metadata": "P. Fierro in Interdisciplinary Aspects of Information Systems Studies", "pdf": false, "title": "Development Methodologies for E-Services in Argentina", "url": "https://link.springer.com/chapter/10.1007/978-3-7908-2010-2_47"}, "37": {"abstract": "Today, the software industry is one of the most rapidly growing sectors and small software development companies play an important role in economy. Many such organizations have been interested in Software Proc...", "metadata": "Deepti Mishra, Alok Mishra in Product-Focused Software Process Improvement", "pdf": false, "title": "Software Process Improvement Methodologies for Small and Medium Enterprises", "url": "https://link.springer.com/chapter/10.1007/978-3-540-69566-0_23"}, "38": {"abstract": "Job satisfaction has been studied by economists and psychologists. We believe this factor is very important in that it influences the effectiveness of the software development process. This paper reports the f...", "metadata": "Katiuscia Mannaro, Marco Melis in Extreme Programming and Agile Processes in…", "pdf": false, "title": "Empirical Analysis on the Satisfaction of IT Employees Comparing XP Practices with Other Software Development Methodologies", "url": "https://link.springer.com/chapter/10.1007/978-3-540-24853-8_19"}, "39": {"abstract": "Choosing the appropriate software development methodology is something which continues to occupy the ... professionals. The introduction of “Agile” development methodologies such as XP and SCRUM held the promise ...", "metadata": "Oisín Cawley, Xiaofeng Wang, Ita Richardson in Lean Enterprise Software and Systems", "pdf": false, "title": "Lean/Agile Software Development Methodologies in Regulated Environments – State of the Art", "url": "https://link.springer.com/chapter/10.1007/978-3-642-16416-3_4"}, "40": {"abstract": "Experience-based approaches to software development promise to capture critical knowledge from software projects that can be used as a basis for continuous improvement of software development practices. Puttin...", "metadata": "Scott Henninger in Advances in Learning Software Organizations", "pdf": false, "title": "Tool Support for Experience-Based Methodologies", "url": "https://link.springer.com/chapter/10.1007/978-3-540-40052-3_6"}, "41": {"abstract": "Though agile methodologies have gained widespread acceptance in the past decade, there are still a number of potential adopters who are yet to join the critical mass. Some of these adopters need assurance of w...", "metadata": "Mali Senapathi in Agile Processes in Software Engineering and Extreme Programming", "pdf": false, "title": "Adoption of Software Engineering Process Innovations: The Case of Agile Software Development Methodologies", "url": "https://link.springer.com/chapter/10.1007/978-3-642-13054-0_23"}, "42": {"abstract": "The following document, presents and analyzes the Risks Analysis in the whole software development life cycle, framed like one of the recommended practices for secure software development. It present and compare ...", "metadata": "José Carrillo Verdún, Gloria Gasca Hurtado in Network Control and Engineering for Qos, S…", "pdf": false, "title": "The risks analysis like a practice of secure software development. A revision of models and methodologies", "url": "https://link.springer.com/chapter/10.1007/978-0-387-34827-8_3"}, "43": {"abstract": "The Enterprise Resource Planning (ERP) implementation is a complex and active process, one that involves a mixture of technological and organizational interactions. Often it is the largest IT project that an orga...", "metadata": "Adnan Kraljić, Tarik Kraljić in Perspectives in Business Informatics Research", "pdf": false, "title": "Agile Software Engineering Practices and ERP Implementation with Focus on SAP Activate Methodology", "url": "https://link.springer.com/chapter/10.1007/978-3-319-99951-7_13"}, "44": {"abstract": "Global software development has changed the overall software development practices. It has introduced various new software development processes and methodologies. A new generation of processes has increasingly r...", "metadata": "Rehan Akbar, Mohd Fadzil Hassan in Software Engineering and Computer Systems", "pdf": false, "title": "A Review of Prominent Work on Agile Processes Software Process Improvement and Process Tailoring Practices", "url": "https://link.springer.com/chapter/10.1007/978-3-642-22203-0_49"}}